{"config": {"layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, null, null, 3]}}, {"name": "conv1_pad", "class_name": "ZeroPadding2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"padding": [[3, 3], [3, 3]], "name": "conv1_pad", "trainable": true, "data_format": "channels_last"}}, {"name": "conv1_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 64, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [7, 7], "name": "conv1_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true}}, {"name": "pool1_pad", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv1_conv", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "name": "pool1_pad", "trainable": true, "data_format": "channels_last"}}, {"name": "pool1_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["pool1_pad", 0, 0, {}]]], "config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "name": "pool1_pool"}}, {"name": "conv2_block1_preact_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["pool1_pool", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv2_block1_preact_bn", "beta_regularizer": null}}, {"name": "conv2_block1_preact_relu", "class_name": "Activation", "inbound_nodes": [[["conv2_block1_preact_bn", 0, 0, {}]]], "config": {"name": "conv2_block1_preact_relu", "trainable": true, "activation": "relu"}}, {"name": "conv2_block1_1_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv2_block1_preact_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 64, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv2_block1_1_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"name": "conv2_block1_1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block1_1_conv", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv2_block1_1_bn", "beta_regularizer": null}}, {"name": "conv2_block1_1_relu", "class_name": "Activation", "inbound_nodes": [[["conv2_block1_1_bn", 0, 0, {}]]], "config": {"name": "conv2_block1_1_relu", "trainable": true, "activation": "relu"}}, {"name": "conv2_block1_2_pad", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv2_block1_1_relu", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "name": "conv2_block1_2_pad", "trainable": true, "data_format": "channels_last"}}, {"name": "conv2_block1_2_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv2_block1_2_pad", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 64, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2_block1_2_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"name": "conv2_block1_2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block1_2_conv", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv2_block1_2_bn", "beta_regularizer": null}}, {"name": "conv2_block1_2_relu", "class_name": "Activation", "inbound_nodes": [[["conv2_block1_2_bn", 0, 0, {}]]], "config": {"name": "conv2_block1_2_relu", "trainable": true, "activation": "relu"}}, {"name": "conv2_block1_0_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv2_block1_preact_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 256, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv2_block1_0_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true}}, {"name": "conv2_block1_3_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv2_block1_2_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 256, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv2_block1_3_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true}}, {"name": "conv2_block1_out", "class_name": "Add", "inbound_nodes": [[["conv2_block1_0_conv", 0, 0, {}], ["conv2_block1_3_conv", 0, 0, {}]]], "config": {"name": "conv2_block1_out", "trainable": true}}, {"name": "conv2_block2_preact_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block1_out", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv2_block2_preact_bn", "beta_regularizer": null}}, {"name": "conv2_block2_preact_relu", "class_name": "Activation", "inbound_nodes": [[["conv2_block2_preact_bn", 0, 0, {}]]], "config": {"name": "conv2_block2_preact_relu", "trainable": true, "activation": "relu"}}, {"name": "conv2_block2_1_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv2_block2_preact_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 64, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv2_block2_1_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"name": "conv2_block2_1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block2_1_conv", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv2_block2_1_bn", "beta_regularizer": null}}, {"name": "conv2_block2_1_relu", "class_name": "Activation", "inbound_nodes": [[["conv2_block2_1_bn", 0, 0, {}]]], "config": {"name": "conv2_block2_1_relu", "trainable": true, "activation": "relu"}}, {"name": "conv2_block2_2_pad", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv2_block2_1_relu", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "name": "conv2_block2_2_pad", "trainable": true, "data_format": "channels_last"}}, {"name": "conv2_block2_2_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv2_block2_2_pad", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 64, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2_block2_2_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"name": "conv2_block2_2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block2_2_conv", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv2_block2_2_bn", "beta_regularizer": null}}, {"name": "conv2_block2_2_relu", "class_name": "Activation", "inbound_nodes": [[["conv2_block2_2_bn", 0, 0, {}]]], "config": {"name": "conv2_block2_2_relu", "trainable": true, "activation": "relu"}}, {"name": "conv2_block2_3_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv2_block2_2_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 256, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv2_block2_3_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true}}, {"name": "conv2_block2_out", "class_name": "Add", "inbound_nodes": [[["conv2_block1_out", 0, 0, {}], ["conv2_block2_3_conv", 0, 0, {}]]], "config": {"name": "conv2_block2_out", "trainable": true}}, {"name": "conv2_block3_preact_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block2_out", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv2_block3_preact_bn", "beta_regularizer": null}}, {"name": "conv2_block3_preact_relu", "class_name": "Activation", "inbound_nodes": [[["conv2_block3_preact_bn", 0, 0, {}]]], "config": {"name": "conv2_block3_preact_relu", "trainable": true, "activation": "relu"}}, {"name": "conv2_block3_1_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv2_block3_preact_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 64, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv2_block3_1_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"name": "conv2_block3_1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block3_1_conv", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv2_block3_1_bn", "beta_regularizer": null}}, {"name": "conv2_block3_1_relu", "class_name": "Activation", "inbound_nodes": [[["conv2_block3_1_bn", 0, 0, {}]]], "config": {"name": "conv2_block3_1_relu", "trainable": true, "activation": "relu"}}, {"name": "conv2_block3_2_pad", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv2_block3_1_relu", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "name": "conv2_block3_2_pad", "trainable": true, "data_format": "channels_last"}}, {"name": "conv2_block3_2_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv2_block3_2_pad", 0, 0, {}]]], "config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 64, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2_block3_2_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"name": "conv2_block3_2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block3_2_conv", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv2_block3_2_bn", "beta_regularizer": null}}, {"name": "conv2_block3_2_relu", "class_name": "Activation", "inbound_nodes": [[["conv2_block3_2_bn", 0, 0, {}]]], "config": {"name": "conv2_block3_2_relu", "trainable": true, "activation": "relu"}}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2_block2_out", 0, 0, {}]]], "config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [1, 1], "padding": "valid", "name": "max_pooling2d_1"}}, {"name": "conv2_block3_3_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv2_block3_2_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 256, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv2_block3_3_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true}}, {"name": "conv2_block3_out", "class_name": "Add", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["conv2_block3_3_conv", 0, 0, {}]]], "config": {"name": "conv2_block3_out", "trainable": true}}, {"name": "conv3_block1_preact_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2_block3_out", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv3_block1_preact_bn", "beta_regularizer": null}}, {"name": "conv3_block1_preact_relu", "class_name": "Activation", "inbound_nodes": [[["conv3_block1_preact_bn", 0, 0, {}]]], "config": {"name": "conv3_block1_preact_relu", "trainable": true, "activation": "relu"}}, {"name": "conv3_block1_1_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv3_block1_preact_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 128, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv3_block1_1_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"name": "conv3_block1_1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block1_1_conv", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv3_block1_1_bn", "beta_regularizer": null}}, {"name": "conv3_block1_1_relu", "class_name": "Activation", "inbound_nodes": [[["conv3_block1_1_bn", 0, 0, {}]]], "config": {"name": "conv3_block1_1_relu", "trainable": true, "activation": "relu"}}, {"name": "conv3_block1_2_pad", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv3_block1_1_relu", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "name": "conv3_block1_2_pad", "trainable": true, "data_format": "channels_last"}}, {"name": "conv3_block1_2_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv3_block1_2_pad", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 128, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv3_block1_2_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"name": "conv3_block1_2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block1_2_conv", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv3_block1_2_bn", "beta_regularizer": null}}, {"name": "conv3_block1_2_relu", "class_name": "Activation", "inbound_nodes": [[["conv3_block1_2_bn", 0, 0, {}]]], "config": {"name": "conv3_block1_2_relu", "trainable": true, "activation": "relu"}}, {"name": "conv3_block1_0_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv3_block1_preact_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 512, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv3_block1_0_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true}}, {"name": "conv3_block1_3_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv3_block1_2_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 512, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv3_block1_3_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true}}, {"name": "conv3_block1_out", "class_name": "Add", "inbound_nodes": [[["conv3_block1_0_conv", 0, 0, {}], ["conv3_block1_3_conv", 0, 0, {}]]], "config": {"name": "conv3_block1_out", "trainable": true}}, {"name": "conv3_block2_preact_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block1_out", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv3_block2_preact_bn", "beta_regularizer": null}}, {"name": "conv3_block2_preact_relu", "class_name": "Activation", "inbound_nodes": [[["conv3_block2_preact_bn", 0, 0, {}]]], "config": {"name": "conv3_block2_preact_relu", "trainable": true, "activation": "relu"}}, {"name": "conv3_block2_1_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv3_block2_preact_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 128, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv3_block2_1_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"name": "conv3_block2_1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block2_1_conv", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv3_block2_1_bn", "beta_regularizer": null}}, {"name": "conv3_block2_1_relu", "class_name": "Activation", "inbound_nodes": [[["conv3_block2_1_bn", 0, 0, {}]]], "config": {"name": "conv3_block2_1_relu", "trainable": true, "activation": "relu"}}, {"name": "conv3_block2_2_pad", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv3_block2_1_relu", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "name": "conv3_block2_2_pad", "trainable": true, "data_format": "channels_last"}}, {"name": "conv3_block2_2_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv3_block2_2_pad", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 128, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv3_block2_2_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"name": "conv3_block2_2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block2_2_conv", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv3_block2_2_bn", "beta_regularizer": null}}, {"name": "conv3_block2_2_relu", "class_name": "Activation", "inbound_nodes": [[["conv3_block2_2_bn", 0, 0, {}]]], "config": {"name": "conv3_block2_2_relu", "trainable": true, "activation": "relu"}}, {"name": "conv3_block2_3_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv3_block2_2_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 512, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv3_block2_3_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true}}, {"name": "conv3_block2_out", "class_name": "Add", "inbound_nodes": [[["conv3_block1_out", 0, 0, {}], ["conv3_block2_3_conv", 0, 0, {}]]], "config": {"name": "conv3_block2_out", "trainable": true}}, {"name": "conv3_block3_preact_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block2_out", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv3_block3_preact_bn", "beta_regularizer": null}}, {"name": "conv3_block3_preact_relu", "class_name": "Activation", "inbound_nodes": [[["conv3_block3_preact_bn", 0, 0, {}]]], "config": {"name": "conv3_block3_preact_relu", "trainable": true, "activation": "relu"}}, {"name": "conv3_block3_1_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv3_block3_preact_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 128, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv3_block3_1_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"name": "conv3_block3_1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block3_1_conv", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv3_block3_1_bn", "beta_regularizer": null}}, {"name": "conv3_block3_1_relu", "class_name": "Activation", "inbound_nodes": [[["conv3_block3_1_bn", 0, 0, {}]]], "config": {"name": "conv3_block3_1_relu", "trainable": true, "activation": "relu"}}, {"name": "conv3_block3_2_pad", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv3_block3_1_relu", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "name": "conv3_block3_2_pad", "trainable": true, "data_format": "channels_last"}}, {"name": "conv3_block3_2_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv3_block3_2_pad", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 128, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv3_block3_2_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"name": "conv3_block3_2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block3_2_conv", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv3_block3_2_bn", "beta_regularizer": null}}, {"name": "conv3_block3_2_relu", "class_name": "Activation", "inbound_nodes": [[["conv3_block3_2_bn", 0, 0, {}]]], "config": {"name": "conv3_block3_2_relu", "trainable": true, "activation": "relu"}}, {"name": "conv3_block3_3_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv3_block3_2_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 512, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv3_block3_3_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true}}, {"name": "conv3_block3_out", "class_name": "Add", "inbound_nodes": [[["conv3_block2_out", 0, 0, {}], ["conv3_block3_3_conv", 0, 0, {}]]], "config": {"name": "conv3_block3_out", "trainable": true}}, {"name": "conv3_block4_preact_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block3_out", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv3_block4_preact_bn", "beta_regularizer": null}}, {"name": "conv3_block4_preact_relu", "class_name": "Activation", "inbound_nodes": [[["conv3_block4_preact_bn", 0, 0, {}]]], "config": {"name": "conv3_block4_preact_relu", "trainable": true, "activation": "relu"}}, {"name": "conv3_block4_1_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv3_block4_preact_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 128, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv3_block4_1_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"name": "conv3_block4_1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block4_1_conv", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv3_block4_1_bn", "beta_regularizer": null}}, {"name": "conv3_block4_1_relu", "class_name": "Activation", "inbound_nodes": [[["conv3_block4_1_bn", 0, 0, {}]]], "config": {"name": "conv3_block4_1_relu", "trainable": true, "activation": "relu"}}, {"name": "conv3_block4_2_pad", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv3_block4_1_relu", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "name": "conv3_block4_2_pad", "trainable": true, "data_format": "channels_last"}}, {"name": "conv3_block4_2_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv3_block4_2_pad", 0, 0, {}]]], "config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 128, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv3_block4_2_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"name": "conv3_block4_2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block4_2_conv", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv3_block4_2_bn", "beta_regularizer": null}}, {"name": "conv3_block4_2_relu", "class_name": "Activation", "inbound_nodes": [[["conv3_block4_2_bn", 0, 0, {}]]], "config": {"name": "conv3_block4_2_relu", "trainable": true, "activation": "relu"}}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv3_block3_out", 0, 0, {}]]], "config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [1, 1], "padding": "valid", "name": "max_pooling2d_2"}}, {"name": "conv3_block4_3_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv3_block4_2_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 512, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv3_block4_3_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true}}, {"name": "conv3_block4_out", "class_name": "Add", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}], ["conv3_block4_3_conv", 0, 0, {}]]], "config": {"name": "conv3_block4_out", "trainable": true}}, {"name": "conv4_block1_preact_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv3_block4_out", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv4_block1_preact_bn", "beta_regularizer": null}}, {"name": "conv4_block1_preact_relu", "class_name": "Activation", "inbound_nodes": [[["conv4_block1_preact_bn", 0, 0, {}]]], "config": {"name": "conv4_block1_preact_relu", "trainable": true, "activation": "relu"}}, {"name": "conv4_block1_1_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv4_block1_preact_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 256, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv4_block1_1_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"name": "conv4_block1_1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv4_block1_1_conv", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv4_block1_1_bn", "beta_regularizer": null}}, {"name": "conv4_block1_1_relu", "class_name": "Activation", "inbound_nodes": [[["conv4_block1_1_bn", 0, 0, {}]]], "config": {"name": "conv4_block1_1_relu", "trainable": true, "activation": "relu"}}, {"name": "conv4_block1_2_pad", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv4_block1_1_relu", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "name": "conv4_block1_2_pad", "trainable": true, "data_format": "channels_last"}}, {"name": "conv4_block1_2_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv4_block1_2_pad", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 256, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv4_block1_2_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"name": "conv4_block1_2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv4_block1_2_conv", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv4_block1_2_bn", "beta_regularizer": null}}, {"name": "conv4_block1_2_relu", "class_name": "Activation", "inbound_nodes": [[["conv4_block1_2_bn", 0, 0, {}]]], "config": {"name": "conv4_block1_2_relu", "trainable": true, "activation": "relu"}}, {"name": "conv4_block1_0_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv4_block1_preact_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 1024, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv4_block1_0_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true}}, {"name": "conv4_block1_3_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv4_block1_2_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 1024, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv4_block1_3_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true}}, {"name": "conv4_block1_out", "class_name": "Add", "inbound_nodes": [[["conv4_block1_0_conv", 0, 0, {}], ["conv4_block1_3_conv", 0, 0, {}]]], "config": {"name": "conv4_block1_out", "trainable": true}}, {"name": "conv4_block2_preact_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv4_block1_out", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv4_block2_preact_bn", "beta_regularizer": null}}, {"name": "conv4_block2_preact_relu", "class_name": "Activation", "inbound_nodes": [[["conv4_block2_preact_bn", 0, 0, {}]]], "config": {"name": "conv4_block2_preact_relu", "trainable": true, "activation": "relu"}}, {"name": "conv4_block2_1_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv4_block2_preact_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 256, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv4_block2_1_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"name": "conv4_block2_1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv4_block2_1_conv", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv4_block2_1_bn", "beta_regularizer": null}}, {"name": "conv4_block2_1_relu", "class_name": "Activation", "inbound_nodes": [[["conv4_block2_1_bn", 0, 0, {}]]], "config": {"name": "conv4_block2_1_relu", "trainable": true, "activation": "relu"}}, {"name": "conv4_block2_2_pad", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv4_block2_1_relu", 0, 0, {}]]], "config": {"padding": [[1, 1], [1, 1]], "name": "conv4_block2_2_pad", "trainable": true, "data_format": "channels_last"}}, {"name": "conv4_block2_2_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv4_block2_2_pad", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 256, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv4_block2_2_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": false}}, {"name": "conv4_block2_2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv4_block2_2_conv", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv4_block2_2_bn", "beta_regularizer": null}}, {"name": "conv4_block2_2_relu", "class_name": "Activation", "inbound_nodes": [[["conv4_block2_2_bn", 0, 0, {}]]], "config": {"name": "conv4_block2_2_relu", "trainable": true, "activation": "relu"}}, {"name": "conv4_block2_3_conv", "class_name": "Conv2D", "inbound_nodes": [[["conv4_block2_2_relu", 0, 0, {}]]], "config": {"strides": [1, 1], "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "filters": 1024, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv4_block2_3_conv", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true}}, {"name": "conv4_block2_out", "class_name": "Add", "inbound_nodes": [[["conv4_block1_out", 0, 0, {}], ["conv4_block2_3_conv", 0, 0, {}]]], "config": {"name": "conv4_block2_out", "trainable": true}}, {"name": "conv4_block3_preact_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv4_block2_out", 0, 0, {}]]], "config": {"scale": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 1.001e-05, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "conv4_block3_preact_bn", "beta_regularizer": null}}, {"name": "conv4_block3_preact_relu", "class_name": "Activation", "inbound_nodes": [[["conv4_block3_preact_bn", 0, 0, {}]]], "config": {"name": "conv4_block3_preact_relu", "trainable": true, "activation": "relu"}}, {"name": 